dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_regdef.h
/** \brief Kernel Reset Register 0 */
typedef struct _Ifx_CIF_BBB_KRST0_Bits
{
    Ifx_Strict_32Bit RST:1;           /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_Strict_32Bit RSTSTAT:1;       /**< \brief [1:1] Kernel Reset Status - RSTSTAT (rh) */
    Ifx_Strict_32Bit reserved_2:30;    /**< \brief [31:2] \internal Reserved */
} Ifx_CIF_BBB_KRST0_Bits;

/** \brief Kernel Reset Register 1 */
typedef struct _Ifx_CIF_BBB_KRST1_Bits
{
    Ifx_Strict_32Bit RST:1;           /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_Strict_32Bit reserved_1:31;    /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_BBB_KRST1_Bits;

/** \brief Kernel Reset Status Clear Register */
typedef struct _Ifx_CIF_BBB_KRSTCLR_Bits
{
    Ifx_Strict_32Bit CLR:1;           /**< \brief [0:0] Kernel Reset Status Clear - CLR (w) */
    Ifx_Strict_32Bit reserved_1:31;    /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_BBB_KRSTCLR_Bits;

/** \brief Module Identification Register */
typedef struct _Ifx_CIF_BBB_MODID_Bits
{
    Ifx_Strict_32Bit MOD_REV:8;       /**< \brief [7:0] Module Revision Number - MOD_REV (r) */
    Ifx_Strict_32Bit MOD_TYPE:8;      /**< \brief [15:8] Module Type - MOD_TYPE (r) */
    Ifx_Strict_32Bit MOD_NUMBER:16;    /**< \brief [31:16] Module Number Value - MOD_NUMBER (r) */
} Ifx_CIF_BBB_MODID_Bits;

/** \brief Clock Control Register */
typedef struct _Ifx_CIF_CCL_Bits
{
    Ifx_Strict_32Bit reserved_0:1;    /**< \brief [0:0] \internal Reserved */
    Ifx_Strict_32Bit CIF_CCLDISS:1;    /**< \brief [1:1] Status of cif_ccl[2] bit - CIF_CCLDISS (r) */
    Ifx_Strict_32Bit CIF_CCLFDIS:1;    /**< \brief [2:2] Clock Control Logic disable - CIF_CCLFDIS (rw) */
    Ifx_Strict_32Bit reserved_3:29;    /**< \brief [31:3] \internal Reserved */
} Ifx_CIF_CCL_Bits;

/** \brief CIF Data Path Control Register */
typedef struct _Ifx_CIF_DPCL_Bits
{
    Ifx_Strict_32Bit CIF_MP_MUX:2;    /**< \brief [1:0] Data path selector for main path - CIF_MP_MUX (rw) */
    Ifx_Strict_32Bit CIF_CHAN_MODE:2;    /**< \brief [3:2] Y/C splitter channel mode - CIF_CHAN_MODE (rw) */
    Ifx_Strict_32Bit reserved_4:4;    /**< \brief [7:4] \internal Reserved */
    Ifx_Strict_32Bit IF_SELECT:2;     /**< \brief [9:8] Selects input interface - IF_SELECT (rw) */
    Ifx_Strict_32Bit reserved_10:22;    /**< \brief [31:10] \internal Reserved */
} Ifx_CIF_DPCL_Bits;

/** \brief Debug Path Control Register */
typedef struct _Ifx_CIF_DP_CTRL_Bits
{
    Ifx_Strict_32Bit DP_EN:1;         /**< \brief [0:0] Debug Path Enable - DP_EN (rw) */
    Ifx_Strict_32Bit DP_SEL:3;        /**< \brief [3:1] Select Source Path which will be transfered over the Debug Interface - DP_SEL (rw) */
    Ifx_Strict_32Bit reserved_4:4;    /**< \brief [7:4] \internal Reserved */
    Ifx_Strict_32Bit RST_FNC:1;       /**< \brief [8:8] Reset Frame Number Counter - RST_FNC (w) */
    Ifx_Strict_32Bit RST_LNC:1;       /**< \brief [9:9] Reset Line Number Counter - RST_LNC (w) */
    Ifx_Strict_32Bit RST_TSC:1;       /**< \brief [10:10] Reset Timestamp Counter - RST_TSC (w) */
    Ifx_Strict_32Bit RST_PD:1;        /**< \brief [11:11] Reset Predivider Counter - RST_PD (w) */
    Ifx_Strict_32Bit reserved_12:1;    /**< \brief [12:12] \internal Reserved */
    Ifx_Strict_32Bit FNC_EN:1;        /**< \brief [13:13] Enable/disable Frame Number Counter - FNC_EN (rw) */
    Ifx_Strict_32Bit LNC_EN:1;        /**< \brief [14:14] Enable/disable Line Number Counter - LNC_EN (rw) */
    Ifx_Strict_32Bit TSC_EN:1;        /**< \brief [15:15] Enable/disable Timestamp Counter - TSC_EN (rw) */
    Ifx_Strict_32Bit UDS1:1;          /**< \brief [16:16] Enable/disable sending of User Defined Symbol 1 - UDS1 (rw) */
    Ifx_Strict_32Bit UDS2:1;          /**< \brief [17:17] Enable/disable sending of User Defined Symbol 2 - UDS2 (rw) */
    Ifx_Strict_32Bit UDS3:1;          /**< \brief [18:18] Enable/disable sending of User Defined Symbol 3 - UDS3 (rw) */
    Ifx_Strict_32Bit UDS4:1;          /**< \brief [19:19] Enable/disable sending of User Defined Symbol 4 - UDS4 (rw) */
    Ifx_Strict_32Bit UDS5:1;          /**< \brief [20:20] Enable/disable sending of User Defined Symbol 5 - UDS5 (rw) */
    Ifx_Strict_32Bit UDS6:1;          /**< \brief [21:21] Enable/disable sending of User Defined Symbol 6 - UDS6 (rw) */
    Ifx_Strict_32Bit UDS7:1;          /**< \brief [22:22] Enable/disable sending of User Defined Symbol 7 - UDS7 (rw) */
    Ifx_Strict_32Bit UDS8:1;          /**< \brief [23:23] Enable/disable sending of User Defined Symbol 8 - UDS8 (rw) */
    Ifx_Strict_32Bit reserved_24:8;    /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_DP_CTRL_Bits;

/** \brief Debug Path Frame/Line Counter Status Register */
typedef struct _Ifx_CIF_DP_FLC_STAT_Bits
{
    Ifx_Strict_32Bit FNC_VAL:15;      /**< \brief [14:0] Returns the current value of the Frame Number Counter - FNC_VAL (r) */
    Ifx_Strict_32Bit reserved_15:1;    /**< \brief [15:15] \internal Reserved */
    Ifx_Strict_32Bit LNC_VAL:15;      /**< \brief [30:16] Returns the current value of the Line Number Counter - LNC_VAL (r) */
    Ifx_Strict_32Bit reserved_31:1;    /**< \brief [31:31] \internal Reserved */
} Ifx_CIF_DP_FLC_STAT_Bits;

/** \brief Debug Path Predivider Control Register */
typedef struct _Ifx_CIF_DP_PDIV_CTRL_Bits
{
    Ifx_Strict_32Bit PDIV_VAL:32;     /**< \brief [31:0] If the Debug Path and the Timestamp Counter are enabled, the timestamp counter will be increased with every pdiv_val+1 CIF module clock cycle. - PDIV_VAL (rw) */
} Ifx_CIF_DP_PDIV_CTRL_Bits;

/** \brief Debug Path Predivider Counter Status Register */
typedef struct _Ifx_CIF_DP_PDIV_STAT_Bits
{
    Ifx_Strict_32Bit PDIV_VAL:32;     /**< \brief [31:0] Returns the current value of the Predivider Counter. - PDIV_VAL (r) */
} Ifx_CIF_DP_PDIV_STAT_Bits;

/** \brief Debug Path Timestamp Counter Status Register */
typedef struct _Ifx_CIF_DP_TSC_STAT_Bits
{
    Ifx_Strict_32Bit TSC_VAL:30;      /**< \brief [29:0] Returns the current value of the Timestamp Counter. - TSC_VAL (r) */
    Ifx_Strict_32Bit reserved_30:2;    /**< \brief [31:30] \internal Reserved */
} Ifx_CIF_DP_TSC_STAT_Bits;

/** \brief Debug Path User Defined Symbol ${x} Register */
typedef struct _Ifx_CIF_DP_UDS_1S_Bits
{
    Ifx_Strict_32Bit UDS:15;          /**< \brief [14:0] User Defined Symbol which may be inserted into debug stream - UDS (rw) */
    Ifx_Strict_32Bit reserved_15:17;    /**< \brief [31:15] \internal Reserved */
} Ifx_CIF_DP_UDS_1S_Bits;

/** \brief Extra Path ${i} Image Cropping Control Register */
typedef struct _Ifx_CIF_EP_IC_CTRL_Bits
{
    Ifx_Strict_32Bit IC_EN:1;         /**< \brief [0:0] Image Cropping Enable - IC_EN (rw) */
    Ifx_Strict_32Bit reserved_1:31;    /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_EP_IC_CTRL_Bits;

/** \brief Extra Path ${i} Image Cropping Camera Displacement Register */
typedef struct _Ifx_CIF_EP_IC_DISPLACE_Bits
{
    Ifx_Strict_32Bit DX:12;           /**< \brief [11:0] Camera Displacement - DX (rw) */
    Ifx_Strict_32Bit reserved_12:4;    /**< \brief [15:12] \internal Reserved */
    Ifx_Strict_32Bit DY:12;           /**< \brief [27:16] Camera Displacement - DY (rw) */
    Ifx_Strict_32Bit reserved_28:4;    /**< \brief [31:28] \internal Reserved */
} Ifx_CIF_EP_IC_DISPLACE_Bits;

/** \brief Extra Path ${i} Image Cropping Horizontal Offset of Output Window Register */
typedef struct _Ifx_CIF_EP_IC_H_OFFS_Bits
{
    Ifx_Strict_32Bit H_OFFS:12;       /**< \brief [11:0] Horizontal Picture Offset - H_OFFS (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_EP_IC_H_OFFS_Bits;

/** \brief Extra Path ${i} Image Cropping Current Horizontal Offset of Output Window Shadow Register */
typedef struct _Ifx_CIF_EP_IC_H_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit H_OFFS_SHD:13;    /**< \brief [12:0] Horizontal Picture Offset - H_OFFS_SHD (r) */
    Ifx_Strict_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_CIF_EP_IC_H_OFFS_SHD_Bits;

