dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_regdef.h
/** \brief ISP Image Stabilization Control Register */
typedef struct _Ifx_CIF_ISPIS_CTRL_Bits
{
    Ifx_Strict_32Bit IS_EN:1;         /**< \brief [0:0] Image Stabilization Enable - IS_EN (rw) */
    Ifx_Strict_32Bit reserved_1:31;    /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_ISPIS_CTRL_Bits;

/** \brief ISP Image Stabilization Camera Displacement Register */
typedef struct _Ifx_CIF_ISPIS_DISPLACE_Bits
{
    Ifx_Strict_32Bit DX:12;           /**< \brief [11:0] Camera Displacement - DX (rw) */
    Ifx_Strict_32Bit reserved_12:4;    /**< \brief [15:12] \internal Reserved */
    Ifx_Strict_32Bit DY:12;           /**< \brief [27:16] Camera Displacement - DY (rw) */
    Ifx_Strict_32Bit reserved_28:4;    /**< \brief [31:28] \internal Reserved */
} Ifx_CIF_ISPIS_DISPLACE_Bits;

/** \brief ISP Image Stabilization Horizontal Offset Of Output Window Register */
typedef struct _Ifx_CIF_ISPIS_H_OFFS_Bits
{
    Ifx_Strict_32Bit IS_H_OFFS:12;    /**< \brief [11:0] Horizontal Picture Offset - IS_H_OFFS (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISPIS_H_OFFS_Bits;

/** \brief ISP Image Current Horizontal Offset Of Output Window Shadow Register */
typedef struct _Ifx_CIF_ISPIS_H_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit IS_H_OFFS_SHD:13;    /**< \brief [12:0] Horizontal Picture Offset - IS_H_OFFS_SHD (r) */
    Ifx_Strict_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_CIF_ISPIS_H_OFFS_SHD_Bits;

/** \brief ISP Image Stabilization Output Horizontal Picture Size Register */
typedef struct _Ifx_CIF_ISPIS_H_SIZE_Bits
{
    Ifx_Strict_32Bit IS_H_SIZE:12;    /**< \brief [11:0] Horizontal Picture Size - IS_H_SIZE (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISPIS_H_SIZE_Bits;

/** \brief ISP Image Current Output Horizontal Picture Size Shadow Register */
typedef struct _Ifx_CIF_ISPIS_H_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit ISP_H_SIZE_SHD:13;    /**< \brief [12:0] Horizontal Picture Size - ISP_H_SIZE_SHD (r) */
    Ifx_Strict_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_CIF_ISPIS_H_SIZE_SHD_Bits;

/** \brief ISP Image Stabilization Maximum Horizontal Displacement Register */
typedef struct _Ifx_CIF_ISPIS_MAX_DX_Bits
{
    Ifx_Strict_32Bit IS_MAX_DX:12;    /**< \brief [11:0] Maximum Horizontal Displacement - IS_MAX_DX (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISPIS_MAX_DX_Bits;

/** \brief ISP Image Stabilization Maximum Vertical Displacement Register */
typedef struct _Ifx_CIF_ISPIS_MAX_DY_Bits
{
    Ifx_Strict_32Bit IS_MAX_DY:12;    /**< \brief [11:0] Maximum Vertical Displacement - IS_MAX_DY (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISPIS_MAX_DY_Bits;

/** \brief ISP Image Stabilization Recenter Register */
typedef struct _Ifx_CIF_ISPIS_RECENTER_Bits
{
    Ifx_Strict_32Bit RECENTER:3;      /**< \brief [2:0] Recenter - RECENTER (rw) */
    Ifx_Strict_32Bit reserved_3:29;    /**< \brief [31:3] \internal Reserved */
} Ifx_CIF_ISPIS_RECENTER_Bits;

/** \brief ISP Image Stabilization Vertical Offset Of Output Window Register */
typedef struct _Ifx_CIF_ISPIS_V_OFFS_Bits
{
    Ifx_Strict_32Bit IS_V_OFFS:12;    /**< \brief [11:0] Vertical Picture Offset - IS_V_OFFS (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISPIS_V_OFFS_Bits;

/** \brief ISP Image Current Vertical Offset Of Output Window Shadow Register */
typedef struct _Ifx_CIF_ISPIS_V_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit IS_V_OFFS_SHD:12;    /**< \brief [11:0] Vertical Picture Offset - IS_V_OFFS_SHD (r) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISPIS_V_OFFS_SHD_Bits;

/** \brief ISP Image Stabilization Output Vertical Picture Size Register */
typedef struct _Ifx_CIF_ISPIS_V_SIZE_Bits
{
    Ifx_Strict_32Bit IS_V_SIZE:12;    /**< \brief [11:0] Vertical Picture Size - IS_V_SIZE (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISPIS_V_SIZE_Bits;

/** \brief ISP Image Current Output Vertical Picture Size Shadow Register */
typedef struct _Ifx_CIF_ISPIS_V_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit ISP_V_SIZE_SHD:12;    /**< \brief [11:0] Vertical Picture Size - ISP_V_SIZE_SHD (r) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISPIS_V_SIZE_SHD_Bits;

/** \brief ISP Acquisition Horizontal Offset Register */
typedef struct _Ifx_CIF_ISP_ACQ_H_OFFS_Bits
{
    Ifx_Strict_32Bit ACQ_H_OFFS:13;    /**< \brief [12:0] Horizontal sample offset - ACQ_H_OFFS (rw) */
    Ifx_Strict_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_CIF_ISP_ACQ_H_OFFS_Bits;

/** \brief ISP Acquisition Horizontal Size Register */
typedef struct _Ifx_CIF_ISP_ACQ_H_SIZE_Bits
{
    Ifx_Strict_32Bit ACQ_H_SIZE:13;    /**< \brief [12:0] Horizontal sample size - ACQ_H_SIZE (rw) */
    Ifx_Strict_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_CIF_ISP_ACQ_H_SIZE_Bits;

/** \brief ISP Acquisition Number of Frames Register */
typedef struct _Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits
{
    Ifx_Strict_32Bit ACQ_NR_FRAMES:10;    /**< \brief [9:0] Number of Input Frames - ACQ_NR_FRAMES (rw) */
    Ifx_Strict_32Bit reserved_10:22;    /**< \brief [31:10] \internal Reserved */
} Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits;

/** \brief ISP Acquisition Properties Register */
typedef struct _Ifx_CIF_ISP_ACQ_PROP_Bits
{
    Ifx_Strict_32Bit SAMPLE_EDGE:1;    /**< \brief [0:0] Sample Edge - SAMPLE_EDGE (rw) */
    Ifx_Strict_32Bit HSYNC_POL:1;     /**< \brief [1:1] Horizontal sync polarity - HSYNC_POL (rw) */
    Ifx_Strict_32Bit VSYNC_POL:1;     /**< \brief [2:2] Vertical sync polarity - VSYNC_POL (rw) */
    Ifx_Strict_32Bit reserved_3:4;    /**< \brief [6:3] \internal Reserved */
    Ifx_Strict_32Bit CCIR_SEQ:2;      /**< \brief [8:7] CCIR Sequence - CCIR_SEQ (rw) */
    Ifx_Strict_32Bit FIELD_SELECTION:2;    /**< \brief [10:9] Field Selection - FIELD_SELECTION (rw) */
    Ifx_Strict_32Bit FIELD_INVERT:1;    /**< \brief [11:11] Field Invert - FIELD_INVERT (rw) */
    Ifx_Strict_32Bit INPUT_SELECTION:4;    /**< \brief [15:12] Input Selection - INPUT_SELECTION (rw) */
    Ifx_Strict_32Bit reserved_16:4;    /**< \brief [19:16] \internal Reserved */
    Ifx_Strict_32Bit INPUT_SELECTION_NO_APP:1;    /**< \brief [20:20] Input Selection No Append - INPUT_SELECTION_NO_APP (rw) */
    Ifx_Strict_32Bit reserved_21:11;    /**< \brief [31:21] \internal Reserved */
} Ifx_CIF_ISP_ACQ_PROP_Bits;

/** \brief ISP Acquistion Vertical Offset Register */
typedef struct _Ifx_CIF_ISP_ACQ_V_OFFS_Bits
{
    Ifx_Strict_32Bit ACQ_V_OFFS:12;    /**< \brief [11:0] Vertical sample offset - ACQ_V_OFFS (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_ACQ_V_OFFS_Bits;

/** \brief ISP Acquisition Vertical Size Register */
typedef struct _Ifx_CIF_ISP_ACQ_V_SIZE_Bits
{
    Ifx_Strict_32Bit ACQ_V_SIZE:12;    /**< \brief [11:0] Vertical sample size - ACQ_V_SIZE (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_ACQ_V_SIZE_Bits;

/** \brief ISP Global Control Register */
typedef struct _Ifx_CIF_ISP_CTRL_Bits
{
    Ifx_Strict_32Bit ISP_ENABLE:1;    /**< \brief [0:0] ISP output enable - ISP_ENABLE (rw) */
    Ifx_Strict_32Bit ISP_MODE:3;      /**< \brief [3:1] ISP Mode - ISP_MODE (rw) */
    Ifx_Strict_32Bit ISP_INFORM_ENABLE:1;    /**< \brief [4:4] ISP Input Formater Enable - ISP_INFORM_ENABLE (rw) */
    Ifx_Strict_32Bit reserved_5:4;    /**< \brief [8:5] \internal Reserved */
    Ifx_Strict_32Bit ISP_CFG_UPD:1;    /**< \brief [9:9] ISP Config Update - ISP_CFG_UPD (w) */
    Ifx_Strict_32Bit ISP_GEN_CFG_UPD:1;    /**< \brief [10:10] ISP Generate Config Update - ISP_GEN_CFG_UPD (w) */
    Ifx_Strict_32Bit reserved_11:2;    /**< \brief [12:11] \internal Reserved */
    Ifx_Strict_32Bit ISP_CSM_Y_RANGE:1;    /**< \brief [13:13] Color Space Matrix luminance clipping range for ISP output - ISP_CSM_Y_RANGE (rw) */
    Ifx_Strict_32Bit ISP_CSM_C_RANGE:1;    /**< \brief [14:14] Color Space Matrix chrominance clipping range for ISP output - ISP_CSM_C_RANGE (rw) */
    Ifx_Strict_32Bit reserved_15:17;    /**< \brief [31:15] \internal Reserved */
} Ifx_CIF_ISP_CTRL_Bits;

/** \brief ISP Error Register */
typedef struct _Ifx_CIF_ISP_ERR_Bits
{
    Ifx_Strict_32Bit INFORM_SIZE_ERR:1;    /**< \brief [0:0] Size error is generated in inform submodule - INFORM_SIZE_ERR (r) */
    Ifx_Strict_32Bit IS_SIZE_ERR:1;    /**< \brief [1:1] Size error is generated in image stabilization submodule - IS_SIZE_ERR (r) */
    Ifx_Strict_32Bit OUTFORM_SIZE_ERR:1;    /**< \brief [2:2] Size error is generated in outmux submodule - OUTFORM_SIZE_ERR (r) */
    Ifx_Strict_32Bit reserved_3:29;    /**< \brief [31:3] \internal Reserved */
} Ifx_CIF_ISP_ERR_Bits;

