dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_regdef.h
/** \brief ISP Error Clear Register */
typedef struct _Ifx_CIF_ISP_ERR_CLR_Bits
{
    Ifx_Strict_32Bit INFORM_SIZE_ERR_CLR:1;    /**< \brief [0:0] Size error is cleared - INFORM_SIZE_ERR_CLR (w) */
    Ifx_Strict_32Bit IS_SIZE_ERR_CLR:1;    /**< \brief [1:1] Size error is cleared - IS_SIZE_ERR_CLR (w) */
    Ifx_Strict_32Bit OUTFORM_SIZE_ERR_CLR:1;    /**< \brief [2:2] Size error is cleared - OUTFORM_SIZE_ERR_CLR (w) */
    Ifx_Strict_32Bit reserved_3:29;    /**< \brief [31:3] \internal Reserved */
} Ifx_CIF_ISP_ERR_CLR_Bits;

/** \brief ISP Shadow Flags Register */
typedef struct _Ifx_CIF_ISP_FLAGS_SHD_Bits
{
    Ifx_Strict_32Bit ISP_ENABLE_SHD:1;    /**< \brief [0:0] ISP enable shadow register - ISP_ENABLE_SHD (r) */
    Ifx_Strict_32Bit ISP_INFORM_ENABLE_SHD:1;    /**< \brief [1:1] Input formatter enable shadow register - ISP_INFORM_ENABLE_SHD (r) */
    Ifx_Strict_32Bit INFORM_FIELD:1;    /**< \brief [2:2] Current field information - INFORM_FIELD (r) */
    Ifx_Strict_32Bit reserved_3:11;    /**< \brief [13:3] \internal Reserved */
    Ifx_Strict_32Bit S_DATA:16;       /**< \brief [29:14] State of ISP input port s_data - S_DATA (r) */
    Ifx_Strict_32Bit S_VSYNC:1;       /**< \brief [30:30] State of ISP input port s_vsync - S_VSYNC (r) */
    Ifx_Strict_32Bit S_HSYNC:1;       /**< \brief [31:31] State of ISP input port s_hsync - S_HSYNC (r) */
} Ifx_CIF_ISP_FLAGS_SHD_Bits;

/** \brief ISP Frame Counter Register */
typedef struct _Ifx_CIF_ISP_FRAME_COUNT_Bits
{
    Ifx_Strict_32Bit FRAME_COUNTER:10;    /**< \brief [9:0] Current Frame Count of Processing - FRAME_COUNTER (r) */
    Ifx_Strict_32Bit reserved_10:22;    /**< \brief [31:10] \internal Reserved */
} Ifx_CIF_ISP_FRAME_COUNT_Bits;

/** \brief ISP Interrupt Clear Register */
typedef struct _Ifx_CIF_ISP_ICR_Bits
{
    Ifx_Strict_32Bit ICR_ISP_OFF:1;    /**< \brief [0:0] Isp was Turned Off (vsynced) - ICR_ISP_OFF (w) */
    Ifx_Strict_32Bit ICR_FRAME:1;     /**< \brief [1:1] Frame was Completely Put Out - ICR_FRAME (w) */
    Ifx_Strict_32Bit ICR_DATA_LOSS:1;    /**< \brief [2:2] Loss of Data - ICR_DATA_LOSS (w) */
    Ifx_Strict_32Bit ICR_PIC_SIZE_ERR:1;    /**< \brief [3:3] Pic Size Violation Occurred - ICR_PIC_SIZE_ERR (w) */
    Ifx_Strict_32Bit reserved_4:1;    /**< \brief [4:4] \internal Reserved */
    Ifx_Strict_32Bit ICR_FRAME_IN:1;    /**< \brief [5:5] Sampled Input Frame is Complete - ICR_FRAME_IN (w) */
    Ifx_Strict_32Bit ICR_V_START:1;    /**< \brief [6:6] Start Edge of v_sync - ICR_V_START (w) */
    Ifx_Strict_32Bit ICR_H_START:1;    /**< \brief [7:7] Start Edge of h_sync - ICR_H_START (w) */
    Ifx_Strict_32Bit reserved_8:11;    /**< \brief [18:8] \internal Reserved */
    Ifx_Strict_32Bit ICR_WD_TRIG:1;    /**< \brief [19:19] A watchdog timeout was triggered at the ISP input - ICR_WD_TRIG (w) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_ISP_ICR_Bits;

/** \brief ISP Interrupt Mask Register */
typedef struct _Ifx_CIF_ISP_IMSC_Bits
{
    Ifx_Strict_32Bit IMSC_ISP_OFF:1;    /**< \brief [0:0] Isp was Turned Off (vsynced) - IMSC_ISP_OFF (rw) */
    Ifx_Strict_32Bit IMSC_FRAME:1;    /**< \brief [1:1] Frame was Completely Put Out - IMSC_FRAME (rw) */
    Ifx_Strict_32Bit IMSC_DATA_LOSS:1;    /**< \brief [2:2] Loss of Data - IMSC_DATA_LOSS (rw) */
    Ifx_Strict_32Bit IMSC_PIC_SIZE_ERR:1;    /**< \brief [3:3] Pic Size Violation Occurred - IMSC_PIC_SIZE_ERR (rw) */
    Ifx_Strict_32Bit reserved_4:1;    /**< \brief [4:4] \internal Reserved */
    Ifx_Strict_32Bit IMSC_FRAME_IN:1;    /**< \brief [5:5] Sampled Input Frame is Complete - IMSC_FRAME_IN (rw) */
    Ifx_Strict_32Bit IMSC_V_START:1;    /**< \brief [6:6] Start Edge of v_sync - IMSC_V_START (rw) */
    Ifx_Strict_32Bit IMSC_H_START:1;    /**< \brief [7:7] Start Edge of h_sync - IMSC_H_START (rw) */
    Ifx_Strict_32Bit reserved_8:11;    /**< \brief [18:8] \internal Reserved */
    Ifx_Strict_32Bit IMSC_WD_TRIG:1;    /**< \brief [19:19] A watchdog timeout was triggered at the ISP input - IMSC_WD_TRIG (rw) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_ISP_IMSC_Bits;

/** \brief ISP Interrupt Set Register */
typedef struct _Ifx_CIF_ISP_ISR_Bits
{
    Ifx_Strict_32Bit ISR_ISP_OFF:1;    /**< \brief [0:0] Isp was Turned Off (vsynced) - ISR_ISP_OFF (w) */
    Ifx_Strict_32Bit ISR_FRAME:1;     /**< \brief [1:1] Frame was Completely Put Out - ISR_FRAME (w) */
    Ifx_Strict_32Bit ISR_DATA_LOSS:1;    /**< \brief [2:2] Loss of Data - ISR_DATA_LOSS (w) */
    Ifx_Strict_32Bit ISR_PIC_SIZE_ERR:1;    /**< \brief [3:3] Pic Size Violation Occurred - ISR_PIC_SIZE_ERR (w) */
    Ifx_Strict_32Bit reserved_4:1;    /**< \brief [4:4] \internal Reserved */
    Ifx_Strict_32Bit ISR_FRAME_IN:1;    /**< \brief [5:5] Sampled Input Frame is Complete - ISR_FRAME_IN (w) */
    Ifx_Strict_32Bit ISR_V_START:1;    /**< \brief [6:6] Start Edge of v_sync - ISR_V_START (w) */
    Ifx_Strict_32Bit ISR_H_START:1;    /**< \brief [7:7] Start Edge of h_sync - ISR_H_START (w) */
    Ifx_Strict_32Bit reserved_8:11;    /**< \brief [18:8] \internal Reserved */
    Ifx_Strict_32Bit ISR_WD_TRIG:1;    /**< \brief [19:19] A watchdog timeout was triggered at the ISP input - ISR_WD_TRIG (w) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_ISP_ISR_Bits;

/** \brief ISP Masked Interrupt Status Register */
typedef struct _Ifx_CIF_ISP_MIS_Bits
{
    Ifx_Strict_32Bit MIS_ISP_OFF:1;    /**< \brief [0:0] Isp was Turned Off (vsynced) - MIS_ISP_OFF (r) */
    Ifx_Strict_32Bit MIS_FRAME:1;     /**< \brief [1:1] Frame was Completely Put Out - MIS_FRAME (r) */
    Ifx_Strict_32Bit MIS_DATA_LOSS:1;    /**< \brief [2:2] Loss of Data - MIS_DATA_LOSS (r) */
    Ifx_Strict_32Bit MIS_PIC_SIZE_ERR:1;    /**< \brief [3:3] Pic Size Violation Occurred - MIS_PIC_SIZE_ERR (r) */
    Ifx_Strict_32Bit reserved_4:1;    /**< \brief [4:4] \internal Reserved */
    Ifx_Strict_32Bit MIS_FRAME_IN:1;    /**< \brief [5:5] Sampled Input Frame is Complete - MIS_FRAME_IN (r) */
    Ifx_Strict_32Bit MIS_V_START:1;    /**< \brief [6:6] Start Edge of v_sync - MIS_V_START (r) */
    Ifx_Strict_32Bit MIS_H_START:1;    /**< \brief [7:7] Start Edge of h_sync - MIS_H_START (r) */
    Ifx_Strict_32Bit reserved_8:11;    /**< \brief [18:8] \internal Reserved */
    Ifx_Strict_32Bit MIS_WD_TRIG:1;    /**< \brief [19:19] A watchdog timeout was triggered at the ISP input - MIS_WD_TRIG (r) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_ISP_MIS_Bits;

/** \brief ISP Output Window Horizontal Offset Register */
typedef struct _Ifx_CIF_ISP_OUT_H_OFFS_Bits
{
    Ifx_Strict_32Bit ISP_OUT_H_OFFS:12;    /**< \brief [11:0] Horizontal Picture Offset - ISP_OUT_H_OFFS (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_OUT_H_OFFS_Bits;

/** \brief ISP Output Window Horizontal Offset Shadow Register */
typedef struct _Ifx_CIF_ISP_OUT_H_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit ISP_OUT_H_OFFS_SHD:12;    /**< \brief [11:0] Current horizontal picture offset - ISP_OUT_H_OFFS_SHD (r) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_OUT_H_OFFS_SHD_Bits;

/** \brief ISP Output Horizontal Picture Size Register */
typedef struct _Ifx_CIF_ISP_OUT_H_SIZE_Bits
{
    Ifx_Strict_32Bit ISP_OUT_H_SIZE:12;    /**< \brief [11:0] Horizontal picture size - ISP_OUT_H_SIZE (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_OUT_H_SIZE_Bits;

/** \brief ISP Output Horizontal Picture Size Shadow Register */
typedef struct _Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit ISP_OUT_H_SIZE_SHD:13;    /**< \brief [12:0] Current horizontal picture size - ISP_OUT_H_SIZE_SHD (r) */
    Ifx_Strict_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits;

/** \brief ISP Output Window Vertical Offset Register */
typedef struct _Ifx_CIF_ISP_OUT_V_OFFS_Bits
{
    Ifx_Strict_32Bit ISP_OUT_V_OFFS:12;    /**< \brief [11:0] Vertical Picture Offset - ISP_OUT_V_OFFS (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_OUT_V_OFFS_Bits;

