dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_regdef.h
/** \brief JPEG Status Interrupt Set Register */
typedef struct _Ifx_CIF_JPE_STATUS_ISR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;    /**< \brief [3:0] \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;    /**< \brief [4:4] Encoding Complete - ENCODE_DONE (w) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;    /**< \brief [5:5] Header Generation Complete - GEN_HEADER_DONE (w) */
    Ifx_Strict_32Bit reserved_6:26;    /**< \brief [31:6] \internal Reserved */
} Ifx_CIF_JPE_STATUS_ISR_Bits;

/** \brief JPEG Status Masked Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_STATUS_MIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;    /**< \brief [3:0] \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;    /**< \brief [4:4] Encoding Complete - ENCODE_DONE (r) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;    /**< \brief [5:5] Header Generation Complete - GEN_HEADER_DONE (r) */
    Ifx_Strict_32Bit reserved_6:26;    /**< \brief [31:6] \internal Reserved */
} Ifx_CIF_JPE_STATUS_MIS_Bits;

/** \brief JPEG Status Raw Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_STATUS_RIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;    /**< \brief [3:0] \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;    /**< \brief [4:4] Encoding Complete - ENCODE_DONE (r) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;    /**< \brief [5:5] Header Generation Complete - GEN_HEADER_DONE (r) */
    Ifx_Strict_32Bit reserved_6:26;    /**< \brief [31:6] \internal Reserved */
} Ifx_CIF_JPE_STATUS_RIS_Bits;

/** \brief JPE Table Programming Register */
typedef struct _Ifx_CIF_JPE_TABLE_DATA_Bits
{
    Ifx_Strict_32Bit TABLE_WDATA_L:8;    /**< \brief [7:0] Table data LSB - TABLE_WDATA_L (w) */
    Ifx_Strict_32Bit TABLE_WDATA_H:8;    /**< \brief [15:8] Table data MSB - TABLE_WDATA_H (w) */
    Ifx_Strict_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CIF_JPE_TABLE_DATA_Bits;

/** \brief JPE Header Generation Debug Register */
typedef struct _Ifx_CIF_JPE_TABLE_FLUSH_Bits
{
    Ifx_Strict_32Bit TABLE_FLUSH:1;    /**< \brief [0:0] Header generation debug control flag - TABLE_FLUSH (rw) */
    Ifx_Strict_32Bit reserved_1:31;    /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_JPE_TABLE_FLUSH_Bits;

/** \brief JPE Table Programming Select Register */
typedef struct _Ifx_CIF_JPE_TABLE_ID_Bits
{
    Ifx_Strict_32Bit TABLE_ID:4;      /**< \brief [3:0] JPE Table ID - TABLE_ID (rw) */
    Ifx_Strict_32Bit reserved_4:28;    /**< \brief [31:4] \internal Reserved */
} Ifx_CIF_JPE_TABLE_ID_Bits;

/** \brief JPE Huffman AC Table 0 Length Register */
typedef struct _Ifx_CIF_JPE_TAC0_LEN_Bits
{
    Ifx_Strict_32Bit TAC0_LEN:8;      /**< \brief [7:0] AC Table 0 Length - TAC0_LEN (rw) */
    Ifx_Strict_32Bit reserved_8:24;    /**< \brief [31:8] \internal Reserved */
} Ifx_CIF_JPE_TAC0_LEN_Bits;

/** \brief JPE Huffman AC Table 1 Length Register */
typedef struct _Ifx_CIF_JPE_TAC1_LEN_Bits
{
    Ifx_Strict_32Bit TAC1_LEN:8;      /**< \brief [7:0] AC Table 1 Length - TAC1_LEN (rw) */
    Ifx_Strict_32Bit reserved_8:24;    /**< \brief [31:8] \internal Reserved */
} Ifx_CIF_JPE_TAC1_LEN_Bits;

/** \brief JPE Huffman DC Table 0 Length Register */
typedef struct _Ifx_CIF_JPE_TDC0_LEN_Bits
{
    Ifx_Strict_32Bit TDC0_LEN:8;      /**< \brief [7:0] DC Table 0 Length - TDC0_LEN (rw) */
    Ifx_Strict_32Bit reserved_8:24;    /**< \brief [31:8] \internal Reserved */
} Ifx_CIF_JPE_TDC0_LEN_Bits;

/** \brief JPE Huffman DC Table 1 Length Register */
typedef struct _Ifx_CIF_JPE_TDC1_LEN_Bits
{
    Ifx_Strict_32Bit TDC1_LEN:8;      /**< \brief [7:0] DC Table 1 Length - TDC1_LEN (rw) */
    Ifx_Strict_32Bit reserved_8:24;    /**< \brief [31:8] \internal Reserved */
} Ifx_CIF_JPE_TDC1_LEN_Bits;

/** \brief Q- table Selector 1, Quant. Table For U Component */
typedef struct _Ifx_CIF_JPE_TQ_U_SELECT_Bits
{
    Ifx_Strict_32Bit TQ1_SELECT:2;    /**< \brief [1:0] Q-Table Selector U - TQ1_SELECT (rw) */
    Ifx_Strict_32Bit reserved_2:30;    /**< \brief [31:2] \internal Reserved */
} Ifx_CIF_JPE_TQ_U_SELECT_Bits;

/** \brief Q- table Selector 2 Quant Table For V Component */
typedef struct _Ifx_CIF_JPE_TQ_V_SELECT_Bits
{
    Ifx_Strict_32Bit TQ2_SELECT:2;    /**< \brief [1:0] Q-Table Selector V - TQ2_SELECT (rw) */
    Ifx_Strict_32Bit reserved_2:30;    /**< \brief [31:2] \internal Reserved */
} Ifx_CIF_JPE_TQ_V_SELECT_Bits;

/** \brief Q- table Selector 0, Quant. Table For Y Component */
typedef struct _Ifx_CIF_JPE_TQ_Y_SELECT_Bits
{
    Ifx_Strict_32Bit TQ0_SELECT:2;    /**< \brief [1:0] Q-Table Selector Y - TQ0_SELECT (rw) */
    Ifx_Strict_32Bit reserved_2:30;    /**< \brief [31:2] \internal Reserved */
} Ifx_CIF_JPE_TQ_Y_SELECT_Bits;

/** \brief JPE Y Value Scaling Control Register */
typedef struct _Ifx_CIF_JPE_Y_SCALE_EN_Bits
{
    Ifx_Strict_32Bit Y_SCALE_EN:1;    /**< \brief [0:0] Y scale flag - Y_SCALE_EN (rw) */
    Ifx_Strict_32Bit reserved_1:31;    /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_JPE_Y_SCALE_EN_Bits;

/** \brief Linear Downscaler Control Register */
typedef struct _Ifx_CIF_LDS_CTRL_Bits
{
    Ifx_Strict_32Bit LDS_V_EN:1;      /**< \brief [0:0] Vertical scaling enable - LDS_V_EN (rw) */
    Ifx_Strict_32Bit LDS_H_EN:1;      /**< \brief [1:1] Horizontal scaling enable - LDS_H_EN (rw) */
    Ifx_Strict_32Bit reserved_2:2;    /**< \brief [3:2] \internal Reserved */
    Ifx_Strict_32Bit LDS_V_MODE:2;    /**< \brief [5:4] Vertical scaling mode - LDS_V_MODE (rw) */
    Ifx_Strict_32Bit reserved_6:2;    /**< \brief [7:6] \internal Reserved */
    Ifx_Strict_32Bit LDS_H_MODE:2;    /**< \brief [9:8] Horizontal scaling mode - LDS_H_MODE (rw) */
    Ifx_Strict_32Bit reserved_10:22;    /**< \brief [31:10] \internal Reserved */
} Ifx_CIF_LDS_CTRL_Bits;

/** \brief Linear Downscaler Factor Register */
typedef struct _Ifx_CIF_LDS_FAC_Bits
{
    Ifx_Strict_32Bit LDS_V_FAC:8;     /**< \brief [7:0] Vertical scaling factor - LDS_V_FAC (rw) */
    Ifx_Strict_32Bit reserved_8:8;    /**< \brief [15:8] \internal Reserved */
    Ifx_Strict_32Bit LDS_H_FAC:8;     /**< \brief [23:16] Horizontal scaling factor - LDS_H_FAC (rw) */
    Ifx_Strict_32Bit reserved_24:8;    /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_LDS_FAC_Bits;

/** \brief Memory Interface Base Address for Extra Path ${j} Data Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;    /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_BASE_AD_INIT:30;    /**< \brief [31:2] Extra Path Base Address Init - EP_BASE_AD_INIT (rw) */
} Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits;

/** \brief Memory Interface Base Address Shadow Register for Extra Path ${j} Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;    /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_BASE_AD:30;    /**< \brief [31:2] Extra Path Base Address - EP_BASE_AD (r) */
} Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits;

/** \brief Memory Interface Extra Path ${j} Control Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_CTRL_Bits
{
    Ifx_Strict_32Bit EP_ENABLE:1;     /**< \brief [0:0] Enables enable ep picture data path - EP_ENABLE (rw) */
    Ifx_Strict_32Bit reserved_1:6;    /**< \brief [6:1] \internal Reserved */
    Ifx_Strict_32Bit BYTE_SWAP:1;     /**< \brief [7:7] Byte Swap Enable - BYTE_SWAP (rw) */
    Ifx_Strict_32Bit reserved_8:12;    /**< \brief [19:8] \internal Reserved */
    Ifx_Strict_32Bit INIT_BASE_EN:1;    /**< \brief [20:20] Init Base Address Enable - INIT_BASE_EN (rw) */
    Ifx_Strict_32Bit INIT_OFFSET_EN:1;    /**< \brief [21:21] Init Offset Counter Enable - INIT_OFFSET_EN (rw) */
    Ifx_Strict_32Bit EP_WRITE_FORMAT:2;    /**< \brief [23:22] Extra Path Write Format - EP_WRITE_FORMAT (rw) */
    Ifx_Strict_32Bit reserved_24:8;    /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_CTRL_Bits;

