dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_regdef.h
/** \brief Memory Interface Global Control Internal Shadow Register */
typedef struct _Ifx_CIF_MI_CTRL_SHD_Bits
{
    Ifx_Strict_32Bit MP_ENABLE_IN:1;    /**< \brief [0:0] Main Picture In Enable - MP_ENABLE_IN (r) */
    Ifx_Strict_32Bit reserved_1:3;    /**< \brief [3:1] \internal Reserved */
    Ifx_Strict_32Bit JPEG_ENABLE_IN:1;    /**< \brief [4:4] JPEG In Enable - JPEG_ENABLE_IN (r) */
    Ifx_Strict_32Bit RAW_ENABLE_IN:1;    /**< \brief [5:5] RAW In Enable - RAW_ENABLE_IN (r) */
    Ifx_Strict_32Bit reserved_6:10;    /**< \brief [15:6] \internal Reserved */
    Ifx_Strict_32Bit MP_ENABLE_OUT:1;    /**< \brief [16:16] Main Picture Out Enable - MP_ENABLE_OUT (r) */
    Ifx_Strict_32Bit reserved_17:1;    /**< \brief [17:17] \internal Reserved */
    Ifx_Strict_32Bit JPEG_ENABLE_OUT:1;    /**< \brief [18:18] JPEG Out Enable - JPEG_ENABLE_OUT (r) */
    Ifx_Strict_32Bit RAW_ENABLE_OUT:1;    /**< \brief [19:19] RAW Out Enable - RAW_ENABLE_OUT (r) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_MI_CTRL_SHD_Bits;

/** \brief MI Interrupt Clear Register */
typedef struct _Ifx_CIF_MI_ICR_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;    /**< \brief [0:0] Main Picture Frame End - MP_FRAME_END (w) */
    Ifx_Strict_32Bit reserved_1:1;    /**< \brief [1:1] \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;     /**< \brief [2:2] Macro Block Line Interrupt - MBLK_LINE (w) */
    Ifx_Strict_32Bit FILL_MPY:1;      /**< \brief [3:3] Fill Main Picture Y - FILL_MPY (w) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;     /**< \brief [4:4] Wrap Main Picture Y - WRAP_MP_Y (w) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;    /**< \brief [5:5] Wrap Main Picture Cb - WRAP_MP_CB (w) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;    /**< \brief [6:6] Wrap Main Picture Cr - WRAP_MP_CR (w) */
    Ifx_Strict_32Bit reserved_7:3;    /**< \brief [9:7] \internal Reserved */
    Ifx_Strict_32Bit BUS_ERROR:1;     /**< \brief [10:10] Bus Error - BUS_ERROR (w) */
    Ifx_Strict_32Bit reserved_11:21;    /**< \brief [31:11] \internal Reserved */
} Ifx_CIF_MI_ICR_Bits;

/** \brief MI Interrupt Mask \u20181\u2019 interrupt active \u20180\u2019 interrupt masked */
typedef struct _Ifx_CIF_MI_IMSC_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;    /**< \brief [0:0] Main Picture Frame End - MP_FRAME_END (rw) */
    Ifx_Strict_32Bit reserved_1:1;    /**< \brief [1:1] \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;     /**< \brief [2:2] Macro Block Line Interrupt - MBLK_LINE (rw) */
    Ifx_Strict_32Bit FILL_MP_Y:1;     /**< \brief [3:3] Fill Main Picture Y - FILL_MP_Y (rw) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;     /**< \brief [4:4] Wrap Main Picture Y - WRAP_MP_Y (rw) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;    /**< \brief [5:5] Wrap Main Picture Cb - WRAP_MP_CB (rw) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;    /**< \brief [6:6] Wrap Main Picture Cr - WRAP_MP_CR (rw) */
    Ifx_Strict_32Bit reserved_7:3;    /**< \brief [9:7] \internal Reserved */
    Ifx_Strict_32Bit BUS_ERROR:1;     /**< \brief [10:10] Bus Error - BUS_ERROR (rw) */
    Ifx_Strict_32Bit reserved_11:21;    /**< \brief [31:11] \internal Reserved */
} Ifx_CIF_MI_IMSC_Bits;

/** \brief Memory Interface Control Register For Address Init And Skip Function Register */
typedef struct _Ifx_CIF_MI_INIT_Bits
{
    Ifx_Strict_32Bit reserved_0:2;    /**< \brief [1:0] \internal Reserved */
    Ifx_Strict_32Bit MI_SKIP:1;       /**< \brief [2:2] Skip Picture - MI_SKIP (w) */
    Ifx_Strict_32Bit reserved_3:1;    /**< \brief [3:3] \internal Reserved */
    Ifx_Strict_32Bit MI_CFG_UPD:1;    /**< \brief [4:4] Forced Configuration Update - MI_CFG_UPD (w) */
    Ifx_Strict_32Bit reserved_5:27;    /**< \brief [31:5] \internal Reserved */
} Ifx_CIF_MI_INIT_Bits;

/** \brief MI Interrupt Set Register */
typedef struct _Ifx_CIF_MI_ISR_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;    /**< \brief [0:0] Main Picture Frame End - MP_FRAME_END (w) */
    Ifx_Strict_32Bit reserved_1:1;    /**< \brief [1:1] \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;     /**< \brief [2:2] Macro Block Line Interrupt - MBLK_LINE (w) */
    Ifx_Strict_32Bit FILL_MP_Y:1;     /**< \brief [3:3] Fill Main Picture Y - FILL_MP_Y (w) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;     /**< \brief [4:4] Wrap Main Picture Y - WRAP_MP_Y (w) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;    /**< \brief [5:5] Wrap Main Picture Cb - WRAP_MP_CB (w) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;    /**< \brief [6:6] Wrap Main Picture Cr - WRAP_MP_CR (w) */
    Ifx_Strict_32Bit reserved_7:3;    /**< \brief [9:7] \internal Reserved */
    Ifx_Strict_32Bit BUS_ERROR:1;     /**< \brief [10:10] Bus Error - Bus_ERROR (w) */
    Ifx_Strict_32Bit reserved_11:21;    /**< \brief [31:11] \internal Reserved */
} Ifx_CIF_MI_ISR_Bits;

/** \brief MI Masked Interrupt Status Registe */
typedef struct _Ifx_CIF_MI_MIS_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;    /**< \brief [0:0] Main Picture Frame End - MP_FRAME_END (r) */
    Ifx_Strict_32Bit reserved_1:1;    /**< \brief [1:1] \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;     /**< \brief [2:2] Macro Block Line Interrupt - MBLK_LINE (r) */
    Ifx_Strict_32Bit FILL_MP_Y:1;     /**< \brief [3:3] Fill Main Picture Y - FILL_MP_Y (r) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;     /**< \brief [4:4] Wrap Main Picture Y - WRAP_MP_Y (r) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;    /**< \brief [5:5] Wrap Main Picture Cb - WRAP_MP_CB (r) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;    /**< \brief [6:6] Wrap Main Picture Cr - WRAP_MP_CR (r) */
    Ifx_Strict_32Bit reserved_7:3;    /**< \brief [9:7] \internal Reserved */
    Ifx_Strict_32Bit BUS_ERROR:1;     /**< \brief [10:10] Bus Error - BUS_ERROR (r) */
    Ifx_Strict_32Bit reserved_11:21;    /**< \brief [31:11] \internal Reserved */
} Ifx_CIF_MI_MIS_Bits;

/** \brief Memory Interface Base Address For Main Picture Cb Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;    /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit MP_CB_BASEAD_INIT:30;    /**< \brief [31:2] Main Picture Cb Base Address Init - MP_CB_BASEAD_INIT (rw) */
} Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits;

