dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_regdef.h
/** \brief Memory Interface Offset Counter Init Value For Main Picture Cb Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT;

/** \brief Memory Interface Current Offset Counter Of Main Picture Cb Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD;

/** \brief Memory Interface Offset Counter Start Value For Main Picture Cb Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_START_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_START;

/** \brief Memory Interface Size Of Main Picture Cb Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_SIZE_INIT;

/** \brief Memory Interface Size Shadow Register Of Main Picture Cb Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_SIZE_SHD;

/** \brief Memory Interface Base Address For Main Picture Cr Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_BASE_AD_INIT;

/** \brief Memory Interface Base Address Shadow Register For Main Picture Cr Component Ring Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_BASE_AD_SHD;

/** \brief Memory Interface Offset Counter Init value For Main Picture Cr Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT;

/** \brief Memory Interface Current Offset Counter Of Main Picture Cr Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD;

/** \brief Memory Interface Offset Counter Start Value For Main Picture Cr Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_START;

/** \brief Memory Interface Size Of Main Picture Cr Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_SIZE_INIT;

/** \brief Memory Interface Size Shadow Register Of Main Picture Cr Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_SIZE_SHD;

/** \brief Memory Interface Base Address For Main Picture Y Component, JPEG or RAW Data Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_BASE_AD_INIT;

/** \brief Memory Interface Base Address Shadow Register For Main Picture Y Component, JPEG Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_BASE_AD_SHD;

/** \brief Memory Interface Fill Level Interrupt Offset Value For Main Picture Y, JPEG or RAW Data Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT;

/** \brief Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Main Picture Y Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD;

/** \brief Memory Interface Offset Counter Init Value For Main Picture Y, JPEG or RAW Data Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT;

