dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_regdef.h
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cif_WD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief WD object */
typedef volatile struct _Ifx_CIF_WD
{
       Ifx_CIF_WD_CTRL                     CTRL;                   /**< \brief 0, Watchdog Control Register*/
       Ifx_CIF_WD_V_TIMEOUT                V_TIMEOUT;              /**< \brief 4, Watchdog Vertical Timeout Register*/
       Ifx_CIF_WD_H_TIMEOUT                H_TIMEOUT;              /**< \brief 8, Watchdog Horizontal Timeout Register*/
       Ifx_CIF_WD_IMSC                     IMSC;                   /**< \brief C, Watchdog Interrupt Mask Register*/
       Ifx_CIF_WD_RIS                      RIS;                    /**< \brief 10, Watchdog Raw Interrupt Status Register*/
       Ifx_CIF_WD_MIS                      MIS;                    /**< \brief 14, Watchdog Masked Interrupt Status Register*/
       Ifx_CIF_WD_ICR                      ICR;                    /**< \brief 18, Watchdog Interrupt Clear Register*/
       Ifx_CIF_WD_ISR                      ISR;                    /**< \brief 1C, Watchdog Interrupt Set Register*/
} Ifx_CIF_WD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cif_LDS_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief LDS object */
typedef volatile struct _Ifx_CIF_LDS
{
       Ifx_CIF_LDS_CTRL                    CTRL;                   /**< \brief 0, Linear Downscaler Control Register*/
       Ifx_CIF_LDS_FAC                     FAC;                    /**< \brief 4, Linear Downscaler Factor Register*/
} Ifx_CIF_LDS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cif_DP_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief DP object */
typedef volatile struct _Ifx_CIF_DP
{
       Ifx_CIF_DP_CTRL                     CTRL;                   /**< \brief 0, Debug Path Control Register*/
       Ifx_CIF_DP_PDIV_CTRL                PDIV_CTRL;              /**< \brief 4, Debug Path Predivider Control Register*/
       Ifx_CIF_DP_FLC_STAT                 FLC_STAT;               /**< \brief 8, Debug Path Frame/Line Counter Status Register*/
       Ifx_CIF_DP_PDIV_STAT                PDIV_STAT;              /**< \brief C, Debug Path Predivider Counter Status Register*/
       Ifx_CIF_DP_TSC_STAT                 TSC_STAT;               /**< \brief 10, Debug Path Timestamp Counter Status Register*/
       Ifx_CIF_DP_UDS_1S                   UDS_1S[8];              /**< \brief 14, Debug Path User Defined Symbol ${x} Register*/
} Ifx_CIF_DP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cif_EP_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief EP object */
typedef volatile struct _Ifx_CIF_EP
{
       Ifx_CIF_EP_IC_CTRL                  IC_CTRL;                /**< \brief 0, Extra Path ${i} Image Cropping Control Register*/
       Ifx_CIF_EP_IC_RECENTER              IC_RECENTER;            /**< \brief 4, Extra Path ${i} Image Cropping Recenter Register*/
       Ifx_CIF_EP_IC_H_OFFS                IC_H_OFFS;              /**< \brief 8, Extra Path ${i} Image Cropping Horizontal Offset of Output Window Register*/
       Ifx_CIF_EP_IC_V_OFFS                IC_V_OFFS;              /**< \brief C, Extra Path ${i} Image Cropping Vertical Offset Of Output Window Register*/
       Ifx_CIF_EP_IC_H_SIZE                IC_H_SIZE;              /**< \brief 10, Extra Path ${i} Image Cropping Output Horizontal Picture Size Register*/
       Ifx_CIF_EP_IC_V_SIZE                IC_V_SIZE;              /**< \brief 14, Extra Path ${i} Image Cropping Output Vertical Picture Size Register*/
       Ifx_CIF_EP_IC_MAX_DX                IC_MAX_DX;              /**< \brief 18, Extra Path ${i} Image Cropping Maximum Horizontal Displacement Register*/
       Ifx_CIF_EP_IC_MAX_DY                IC_MAX_DY;              /**< \brief 1C, Extra Path ${i} Image Cropping Maximum Vertical Displacement Register*/
       Ifx_CIF_EP_IC_DISPLACE              IC_DISPLACE;            /**< \brief 20, Extra Path ${i} Image Cropping Camera Displacement Register*/
       Ifx_CIF_EP_IC_H_OFFS_SHD            IC_H_OFFS_SHD;          /**< \brief 24, Extra Path ${i} Image Cropping Current Horizontal Offset of Output Window Shadow Register*/
       Ifx_CIF_EP_IC_V_OFFS_SHD            IC_V_OFFS_SHD;          /**< \brief 28, Extra Path ${i} Image Cropping Current Vertical Offset Of Output Window Shadow Register*/
       Ifx_CIF_EP_IC_H_SIZE_SHD            IC_H_SIZE_SHD;          /**< \brief 2C, Extra Path ${i} Image Cropping Current Output Horizontal Picture Size Shadow Register*/
       Ifx_CIF_EP_IC_V_SIZE_SHD            IC_V_SIZE_SHD;          /**< \brief 30, Extra Path ${i} Image Cropping Current Output Vertical Picture Size Shadow Register*/
       Ifx_UReg_8Bit                       reserved_34[204];       /**< \brief 34, \internal Reserved */
} Ifx_CIF_EP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cif_MIEP_CH_1S_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief CH_1S object */
typedef volatile struct _Ifx_CIF_MIEP_CH_1S
{
       Ifx_CIF_MIEP_CH_1S_CTRL             CTRL;                   /**< \brief 0, Memory Interface Extra Path ${j} Control Register*/
       Ifx_CIF_MIEP_CH_1S_INIT             INIT;                   /**< \brief 4, Memory Interface Extra Path ${j} Control Register For Address Init And Skip Function Register*/
       Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT     BASE_AD_INIT;           /**< \brief 8, Memory Interface Base Address for Extra Path ${j} Data Buffer Register*/
       Ifx_CIF_MIEP_CH_1S_SIZE_INIT        SIZE_INIT;              /**< \brief C, Memory Interface Size of Extra Path ${j} Data Buffer Register*/
       Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT    OFFS_CNT_INIT;          /**< \brief 10, Memory Interface Offset Counter Init Value For Extra Path ${j} Buffer Register*/
       Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START   OFFS_CNT_START;         /**< \brief 14, Memory Interface Offset Counter Start Value for Extra Path ${j} Register*/
       Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT    IRQ_OFFS_INIT;          /**< \brief 18, Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register*/
       Ifx_CIF_MIEP_CH_1S_CTRL_SHD         CTRL_SHD;               /**< \brief 1C, Memory Interface Extra Path ${j} Control Internal Shadow Register*/
       Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD      BASE_AD_SHD;            /**< \brief 20, Memory Interface Base Address Shadow Register for Extra Path ${j} Buffer Register*/
       Ifx_CIF_MIEP_CH_1S_SIZE_SHD         SIZE_SHD;               /**< \brief 24, Memory Interface Size Shadow Register of Extra Path ${j} Buffer Register*/
       Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD     OFFS_CNT_SHD;           /**< \brief 28, Memory Interface Current Offset Counter of Extra Path ${j} Buffer Register*/
       Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD     IRQ_OFFS_SHD;           /**< \brief 2C, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path ${j} Register*/
       Ifx_UReg_8Bit                       reserved_30[208];       /**< \brief 30, \internal Reserved */
} Ifx_CIF_MIEP_CH_1S;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cif_MIEP_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief MIEP object */
typedef volatile struct _Ifx_CIF_MIEP
{
       Ifx_CIF_MIEP_STA_ERR                STA_ERR;                /**< \brief 0, Extra Path Error Register*/
       Ifx_CIF_MIEP_STA_ERR_CLR            STA_ERR_CLR;            /**< \brief 4, Extra Path Status Error Clear Register*/
       Ifx_CIF_MIEP_IMSC                   IMSC;                   /**< \brief 8, MI Extra Path Interrupt Mask \u20181\u2019: interrupt active, \u20180\u2019: interrupt masked*/
       Ifx_CIF_MIEP_RIS                    RIS;                    /**< \brief C, MI Extra Path Raw Interrupt Status Register*/
       Ifx_CIF_MIEP_MIS                    MIS;                    /**< \brief 10, MI Extra Path Masked Interrupt Status Register*/
       Ifx_CIF_MIEP_ICR                    ICR;                    /**< \brief 14, MI Extra Path Interrupt Clear Register*/
       Ifx_CIF_MIEP_ISR                    ISR;                    /**< \brief 18, MI Extra Path Interrupt Set Register*/
       Ifx_UReg_8Bit                       reserved_1C[228];       /**< \brief 1C, \internal Reserved */
       Ifx_CIF_MIEP_CH_1S                  CH_1S[5];               /**< \brief 100, */
} Ifx_CIF_MIEP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Cif_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

